25-object-oriented-javascript/movies-api/app/controllers/api/v1/movies_controller.rb

  def index
    @movies = Movie.all.sort_by { |movie| movie.title }
---
SELECT "movies".* FROM "movies"

  def update
    @movie = Movie.find(params[:id])

    @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "score" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["score", 13], ["updated_at", "2020-02-03 16:22:36.706331"], ["id", 1]]

  def create
    @movie = Movie.create(movie_params)
---
INSERT INTO "movies" ("title", "year", "score", "imageUrl", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"